shilai-li/xiaobai/swm221/app/src/CSL/SWM221_StdPeriph_Driver/SWM221_wdt.c
/****************************************************************************************************************************************** 
* 文件名称: SWM221_wdt.c
* 功能说明:	SWM221单片机的WDT看门狗功能驱动库
* 技术支持:	http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项:
* 版本日期:	V1.0.0		2016年1月30日
* 升级记录:  
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include "SWM221.h"
#include "SWM221_wdt.h"


/****************************************************************************************************************************************** 
* 函数名称:	WDT_Init()
* 功能说明:	WDT看门狗初始化
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
*			uint32_t int_period		中断周期，取值1--65534，单位1/1000秒，取值0表示关闭WDT中断功能
*			uint32_t rst_period		复位周期，取值1--65534，单位1/1000秒，取值0表示关闭WDT复位功能
* 输    出: 无
* 注意事项: 此函数只能在芯片上电后调用一次，若需要重新配置 WDT，请调用 WDT_ReInit()
******************************************************************************************************************************************/
void WDT_Init(WDT_TypeDef * WDTx, uint32_t int_period, uint32_t rst_period)
{
	SYS->CLKEN0 |= (1 << SYS_CLKEN0_WDT_Pos);
	
	WDTx->CR &= ~WDT_CR_CLKDIV_Msk;
	WDTx->CR |= (4 << WDT_CR_CLKDIV_Pos);		//时钟32分频
	
	if(int_period == 0)
	{
		WDTx->CR &= ~(1 << WDT_CR_INTEN_Pos);
		
		NVIC_DisableIRQ(WDT_IRQn);
	}
	else
	{
		WDTx->CR |=  (1 << WDT_CR_INTEN_Pos);
		
		WDTx->INTVAL = int_period;
		
		WDTx->IF = 1;
		NVIC_EnableIRQ(WDT_IRQn);
	}
	
	if(rst_period == 0)
	{
		WDTx->CR &= ~(1 << WDT_CR_RSTEN_Pos);
		
		WDTx->RSTVAL = int_period + 1;
	}
	else
	{
		WDTx->CR |=  (1 << WDT_CR_RSTEN_Pos);
		
		WDTx->RSTVAL = rst_period;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_ReInit()
* 功能说明:	WDT看门狗重新初始化
* 输    入: 同 WDT_Init()
* 输    出: 无
* 注意事项: 执行 WDT_ReInit() 前请不要执行 WDT_Stop()，因为 WDT 停止状态下无法清零内部计数器
******************************************************************************************************************************************/
void WDT_ReInit(WDT_TypeDef * WDTx, uint32_t int_period, uint32_t rst_period)
{
	int i;
	
	/* WDT 已经在运行中，若新设置的 rst_period 比当前计数器值还小，WDT 需要计数到 2^16 溢出返回 0 才能触发中断和复位，
	   这里执行一下喂狗，保证计数器从零重新计数，避免上述问题 */
	WDT_Feed(WDTx);
	
	/* 等待 WDT 内部完成喂狗操作，计数器清零 */
	for(i = 0; i < CyclesPerUs * 300 / 4; i++) __NOP();
	
	WDT_Stop(WDTx);
	
	WDT_Init(WDTx, int_period, rst_period);
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_Start()
* 功能说明:	启动指定WDT，开始倒计时
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WDT_Start(WDT_TypeDef * WDTx)
{
	WDTx->CR |=  (1 << WDT_CR_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_Stop()
* 功能说明:	关闭指定WDT，停止倒计时
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WDT_Stop(WDT_TypeDef * WDTx)
{
	WDTx->CR &= ~(1 << WDT_CR_EN_Pos);
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_Feed()
* 功能说明:	喂狗，重新从装载值开始倒计时
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WDT_Feed(WDT_TypeDef * WDTx)
{
	if(WDTx->CR & WDT_CR_EN_Msk) // WDT 停止状态下，不执行喂狗
		WDTx->FEED = 0x55;
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_INTClr()
* 功能说明:	中断标志清除
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void WDT_INTClr(WDT_TypeDef * WDTx)
{
	WDTx->IF = 1;
}

/****************************************************************************************************************************************** 
* 函数名称:	WDT_INTStat()
* 功能说明:	中断状态查询
* 输    入: WDT_TypeDef * WDTx		指定要被设置的看门狗，有效值包括WDT
* 输    出: int32_t					1 发生中断溢出    0 未发生中断溢出
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t WDT_INTStat(WDT_TypeDef * WDTx)
{
	return WDTx->IF;
}
